{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-COMPANY",
    "2": "I-COMPANY",
    "3": "B-ROLE",
    "4": "I-ROLE",
    "5": "B-START_DATE",
    "6": "I-START_DATE",
    "7": "B-END_DATE",
    "8": "I-END_DATE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-COMPANY": 1,
    "B-END_DATE": 7,
    "B-ROLE": 3,
    "B-START_DATE": 5,
    "I-COMPANY": 2,
    "I-END_DATE": 8,
    "I-ROLE": 4,
    "I-START_DATE": 6,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
